# BadViewType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImageFailures..::..BadViewType Property
BuiltInFailures..::..ImageFailures Class See Also
---
Image Instances can't be placed in 3D Views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadViewType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadViewType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadViewType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImageFailures Class
Autodesk.Revit.DB Namespace